{
  "menu": {
    "design": "Дизайн",
    "portfolio": "Портфолио",
    "cv": "Резюме",
    "contacts": "Контакты",
    "chooseLanguage": {
      "btnText": "Язык",
      "inputDummyText": "Выберите язык",
      "changeLangBtnText": "Сменить язык",
      "blockTitle": "Выберите язык"
    }
  },
  "portfolio": {
    "blockTitle": "Портфолио",
    "blockDescription": "Здесь собрана часть моих работ, которыми можно похвастаться"
  },
  "projectCard": {
    "viewMoreTxtDesktop": "Подробнее",
    "viewMoreTxtMobile": "Кликните еще раз"
  },
  "bfBot": {
    "title": "Бот для цветочного магазина",
    "description": "Телеграм бот для цветочного магазина моей тетушки, позволяющий получить информацию об ассортименте, узнать информацию о компании и заказать себе букет. Процесс заказа включает в себя несколько этапов: выбор подходящей даты, времени, способа доставки и самого букета. Расплатиться можно или при получении, или внутри самой платформы при помощи Telegram Payments."
  },
  "cards": {
    "title": "Карточки для отображения товаров",
    "description": "Это было тестовое задание для одной из компаний. Задача: получить список товаров при помощи AJAX и оформить данные в соответствии с собственным чувством прекрасного. Для отображения данных выбрал карточки как самый оптимальный вариант: наглядно, независимо, изящно. Вдохновлялся плавностью элементов у iOS, потому каждая стрелочка, список, название – все плавно появляется, крутится и т.д."
  },
  "calculator": {
    "title": "JS-реализация игры \"Calculator\" для iOS",
    "description": "Это был первый серьезный проект – не верстка статичных страниц, а полноценная реализация логики при помощи js. У меня на телефоне была игра, где было число, которое нужно было получить, исходное число, количество доступных шагов и доступные математические операции (\"+2\", \"3\" и пр.). Задача игрока за отведенное количество шагов, используя доступные операции получить требуемое число.\nЯ выписал весь функционал игры, а потом для практики программирования повторил его, только на том языке программирования, который изучал. К сожалению, были реализованы не все желаемые функции (например: переключение уровней). В будущем планируется добавить конструктор уровней."
  },
  "thisApp": {
    "title": "Портфолио",
    "description": "Нужно показать что умеешь и повысить свою конкурентоспособность. Для этого был придуман сайт-портфолио, на котором будут лежать уже имеющиеся работы, а также резюме не в формате *.docx и контактные данные. Кроме того сам сайт также является еще одним проектом в портфолио. Для получения дополнительных баллов я выучил фреймворк Vue.js и использовал его для реализации данного проекта. В качестве основы для создания компонентов было использовано руководство Material Design."
  },
  "projectViewBlock": {
    "projectLinksTitle": "Ссылки на проект",
    "techStackBlockTitle": "Стэк технологий",
    "btnText": "Посмотреть"
  },
  "cvBlock": {
    "title": "Резюме",
    "description": "Нужная информация для приема на работу"
  },
  "checkoutCertificateBtnText": "Сертификат",
  "education": {
    "title": "Высшее образование",
    "description": "Дипломы",
    "data": {
      "univ1": "Томский политехнический университет (2013 - 2018)",
      "univ2": "Харбинский политехнический университет (2017)"
    }
  },
  "spokenLanguages": {
    "title": "Владение языками",
    "description": "Читаю на этих языках документацию и общаюсь на них за бутылкой пива",
    "data": {
      "lang1": "Английский (владею свободно: IELTS 6.9)",
      "lang2": "Китайский (владею свободно: HSK5)"
    }
  },
  "courses": {
    "title": "Курсы",
    "description": "Люблю учиться. Платно и бес-"
  },
  "techStack": {
    "title": "Стэк технологий",
    "description": "Пишу на этом"
  },
  "graphicSoftware": {
    "title": "Владение графическими ПО",
    "description": "Могу достать иконку и шрифты, только если макет не был прислан в формате *.docx"
  },
  "coreSkills": {
    "title": "Профильные навыки",
    "description": "Пользуюсь этим на работе",
    "data": {
      "skill1": "Адаптивная верстка",
      "skill2": "Кроссбраузерная верстка",
      "skill3": "Знаю основы UI/UX"
    }
  },
  "nonCoreSkills": {
    "title": "Непрофильные навыки",
    "description": "Пользуюсь этим в жизни",
    "data": {
      "skill1": "Чувство прекрасного",
      "skill2": "Умеренный перфекционизм"
    }
  },
  "extra": {
    "title": "Прочее",
    "description": "Чем еще могу похвастаться",
    "data": {
      "extra1": "Проживание и обучение в Китае (2017 - 2018)",
      "extra2": "Преподавание английского в Китае и России",
      "extra3": "Дистанционное преподавание английского китайцам (2017 – настоящее время)"
    }
  },
  "about": {
    "title": "О себе",
    "data": "Люблю решать нетривиальные задачи и создавать прикладные продукты. Не важно, что из себя представляет проект. Это может быть бот для цветочного магазина, генератор китайского мата или система бронирования столиков – главное, чтоб он был полезен людям и для его реализации нужно было пораскинуть мозгами. "
  }
}